In [195]:
import pandas as pd
import numpy as np

**Section 1: DataFrame & Series Creation (1-10)**

1. Create a Series from a list: Ek list [10, 20, 30, 40, 50] se ek pandas Series banayein

In [196]:
my_list = [10,20,30,40,50]

In [197]:
pd.Series(my_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

**2. Create a Series with a custom index: Ek list ['a', 'b', 'c', 'd'] ko index ke taur par istemal
karke, [100, 200, 300, 400] values ke saath ek Series banayein**

In [198]:
label = ['a','b','c','d']
my_list = [100,200,300,400]

In [199]:
pd.Series(my_list,index=label)

a    100
b    200
c    300
d    400
dtype: int64

**3. Create a DataFrame from a dictionary: {'Name': ['Aniket', 'Priya', 'Rohan'], 'Age': [28, 24, 22]}
dictionary se ek DataFrame banayein.**

In [200]:
data = {
    'Name': ['Aniket', 'Priya', 'Rohan'],
    'Age': [28, 24, 22]
}
df = pd.DataFrame(data)

In [201]:
df

     Name  Age
0  Aniket   28
1   Priya   24
2   Rohan   22

**4. Create a DataFrame from a list of lists: Ek list of lists [['Alice', 25], ['Bob', 30], ['Charlie', 35]]
se ek DataFrame banayein aur columns ko 'Name' aur 'Age' naam dein**

In [202]:
my_list = [
    ['Alice', 25],
    ['Bob', 30],
    ['Charlie', 35]
]
df = pd.DataFrame(my_list)

In [203]:
df

         0   1
0    Alice  25
1      Bob  30
2  Charlie  35

**5. Create a DataFrame with a specified index: ['row1', 'row2'] ko index ke taur par use karke
{'col1': [1, 2], 'col2': [3, 4]} data se ek DataFrame banayein.**

In [204]:
data = {
    'col1': [1,2],
    'col2':[3,4]
}
df = pd.DataFrame(data,index=['row1','row'])
df

      col1  col2
row1     1     3
row      2     4

**6. Create a DataFrame of a specific size: 5 rows aur 3 columns ka ek DataFrame banayein
jismein saari values NaN (Not a Number) hon.**

In [205]:
df = pd.DataFrame(np.nan, index=range(5), columns=['col1', 'col2', 'col3'])
df

   col1  col2  col3
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2   NaN   NaN   NaN
3   NaN   NaN   NaN
4   NaN   NaN   NaN

**7. Create a DataFrame with random numbers: 4 rows aur 4 columns ka ek DataFrame
banayein jismein 0 se 100 ke beech random integers hon**

In [206]:
df = pd.DataFrame(np.random.randint(0,100 ,size=(4,4)) , columns = ['col1','col2','col3','col4'])

In [207]:
df

   col1  col2  col3  col4
0    14    76    10    87
1    67    88    43    69
2    85    38    95     9
3    93     8    98    19

**8. Create a Series from a dictionary: {'apples': 40, 'bananas': 50, 'cherries': 80} dictionary se ek
Series banayein.**

In [208]:

d = {'apples': 40, 'bananas': 50, 'cherries': 80}

In [209]:
pd.Series(d)

apples      40
bananas     50
cherries    80
dtype: int64

**9. Convert a NumPy array to a DataFrame: Ek 3x3 NumPy array se ek pandas DataFrame
banayein**

In [210]:
df = np.array([[10,20,30],[40,50,60],[70,80,90]])

df=pd.DataFrame(df,columns=['col1','col2','col3'] )

**10. Create a copy of a DataFrame: Pehle banaye gaye kisi bhi DataFrame ki ek copy banayein**

In [211]:
df

   col1  col2  col3
0    10    20    30
1    40    50    60
2    70    80    90

In [212]:
df_copy=df.copy

In [213]:
df_copy

<bound method NDFrame.copy of    col1  col2  col3
0    10    20    30
1    40    50    60
2    70    80    90>

**Section 2: Data Inspection & Basic Info (11-20)**

**11. Display first 5 rows: Ek CSV file se data load karein aur uske pehle 5 rows (head) ko display
karein.**

In [215]:

data = {
    'Name': ['Amit', 'Priya', 'Raj', 'Sneha', 'Karan', 'Meera'],
    'Age': [23, 25, 21, 22, 24, 26],
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Pune', 'Jaipur']
}

df = pd.DataFrame(data)


df.to_csv("sample.csv", index=False)

df_loaded = pd.read_csv("sample.csv")


print(df_loaded.head())

    Name  Age     City
0   Amit   23    Delhi
1  Priya   25   Mumbai
2    Raj   21  Kolkata
3  Sneha   22  Chennai
4  Karan   24     Pune

**12. Display last 3 rows: Usi DataFrame ke aakhri 3 rows (tail) ko display karein.**

In [ ]:
df_loaded.tail(3)

    Name  Age     City
3  Sneha   22  Chennai
4  Karan   24     Pune
5  Meera   26   Jaipur

**13. Get the shape: DataFrame ka shape (number of rows and columns) pata karein**

In [ ]:
df_loaded.shape

(6, 3)

**14. Get column names: DataFrame ke sabhi columns ke naam list karein.**

In [ ]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

**15. Get the index: DataFrame ka index display karein**

In [ ]:
df.index

RangeIndex(start=0, stop=6, step=1)

**Get data types: Har column ka data type (dtype) pata karein.**

In [ ]:
df = pd.DataFrame(data)
df.dtypes

Name    object
Age      int64
City    object
dtype: object

**17. Get DataFrame info: DataFrame ki ek concise summary (non-null values, memory usage,
etc.) paane ke liye .info() method ka use karein.**

In [ ]:
df.info(())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [ ]:
df

    Name  Age     City
0   Amit   23    Delhi
1  Priya   25   Mumbai
2    Raj   21  Kolkata
3  Sneha   22  Chennai
4  Karan   24     Pune
5  Meera   26   Jaipur

**18. Count unique values: Ek specific column (e.g., 'City') mein unique values ki ginti karein.**

In [ ]:
df1 = pd.DataFrame(data)

In [ ]:
(df['City'].nunique())

6

In [ ]:
(df['City'].value_counts())

City
Delhi      1
Mumbai     1
Kolkata    1
Chennai    1
Pune       1
Jaipur     1
Name: count, dtype: int64

19. Get unique values: Ek column mein maujood sabhi unique values ko list karein

In [ ]:
df

    Name  Age     City
0   Amit   23    Delhi
1  Priya   25   Mumbai
2    Raj   21  Kolkata
3  Sneha   22  Chennai
4  Karan   24     Pune
5  Meera   26   Jaipur

In [ ]:
(df['City'].unique())

array(['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Pune', 'Jaipur'],
      dtype=object)

**20. Get descriptive statistics: DataFrame ke sabhi numerical columns ke liye descriptive
statistics (mean, std, min, max, etc.) generate karein.**

In [ ]:
df.describe(())

       col1  col2  col3
count   3.0   3.0   3.0
mean   40.0  50.0  60.0
std    30.0  30.0  30.0
min    10.0  20.0  30.0
50%    40.0  50.0  60.0
max    70.0  80.0  90.0